# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 272 layers, 2,602,288 parameters, 2,602,272 gradients, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 272 layers, 9,284,096 parameters, 9,284,080 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 292 layers, 20,199,168 parameters, 20,199,152 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 488 layers, 26,450,784 parameters, 26,450,768 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 488 layers, 59,210,784 parameters, 59,210,768 gradients, 200.3 GFLOPs

ch: 6

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]  # 0-P1/2
  - [0, 1, SilenceChannel, [0,3]]  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10

  - [0, 1, SilenceChannel, [3,6]]  # 11-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 12-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 13-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 15-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 17-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 19-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 20

  - [ [6,8,10, 16,18,20], 1, RGBAdjuster, [3, 1, True, False, False, False, True, 3]]  #  21 affine

  - [ -1, 1, SilenceList, [ 16, 0 ] ]  # 22 #rgb
  - [ 21, 1, SilenceList, [ 16, 1 ] ]  # 23 #rgb—centerpoints
  - [ 21, 1, SilenceList, [ 16, 2 ] ]  # 24 #rgb-uav_exist
  - [ 21, 1, SilenceList, [ 16, 3 ] ]  # 25 #rgb-ir-offsets

  - [ 22, 1, SilenceList, [ 128, 0 ] ]  # 26 #第一层.已经对齐
  - [ 22, 1, SilenceList, [ 128, 1 ] ]  # 27 #第二层
  - [ 22, 1, SilenceList, [ 256, 2 ] ]  # 28 #第三层

  - [[26, 16], 1, Concat, [1]]  # cat backbone P3   29
  - [[27, 18], 1, Concat, [1]]  # cat backbone P4   30
  - [[28, 20], 1, Concat, [1]]  # cat backbone P5   31
# YOLO12n head
head:

  - [26, 1, nn.AvgPool2d, [2, 2, 0]] # 32
  - [28, 1, nn.Upsample, [None, 2, 'nearest']] # 33
  - [[32, 27, 33], 1, Concat, [1]]  # cat 34
  - [-1, 1, Conv, [1024, 1, 1]] # 35
  # infrared
  - [16, 1, nn.AvgPool2d, [2, 2, 0]] # 36
  - [20, 1, nn.Upsample, [None, 2, 'nearest']] # 37
  - [[36, 18, 37], 1, Concat, [1]]  # cat 38
  - [-1, 1, Conv, [1024, 1, 1]] # 39

  - [[35,39], 1, SoftHGBlock, [16, 8, 8, 0.1]] # 40 #
  - [-1, 2, A2C2f, [512, False, -1]] # 41
#
  # Semantic Collecting
  - [31, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 30, 41], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 44

  - [41, 1, nn.Upsample, [None, 2, "nearest"]]
  - [44, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 29, 45], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 48

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 44, 41], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 51

  - [41, 1, nn.AvgPool2d, [2, 2, 0]] 
  - [51, 1, Conv, [512, 3, 2]]
  - [[-1, 31, 52], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 55 (P5/32-large)

  - [[48, 51, 55, 23, 24, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)
