nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12-SoftHGNNn.yaml' will call yolov12-SoftHGNN.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024] 
  m: [0.50, 1.00, 512]

# YOLOv12-SoftHGNN backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] 
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] 
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] 
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] 
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]] 
  - [-1, 4, A2C2f, [1024, True, 1]]  

# YOLOv12-SoftHGNN head
head:
  - [[4, 6, 8], 1, F2SoftHG, [1, True, True, 1, 0.5]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [ 9, 1, ShapeAlignConv, []]
  - [[6, 9], 1, MergeConv, []] 
  - [[4, 10], 1, MergeConv, []] 
  - [[8, 11], 1, MergeConv, []] 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]] 
  - [-1, 2, A2C2f, [512, False, -1]] 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, A2C2f, [256, False, -1]] 

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] 
  - [-1, 2, A2C2f, [512, False, -1]] 

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] 

  - [[20, 23, 26], 1, Detect, [nc]] 